package CyberLibrary;

public class 아이디어 {

	public static void main(String[] args) {
		/* 전자도서관 시스템
		 * 
		 * <인천광역시 전자도서관>
		 *     --로그인--
		 *    1.사서|2.회원
		 * 
		 * 1.사서
		 * 로그인 id/pw
		 * 회원가입
		 * ===========
		 * 1.도서등록
		 * - 제목 
		 * - 지은이
		 * - 장르
		 * - 권수(대여가능여부와 연관)
		 * - 출판사
		 * 2. 도서수정
		 * 3. 도서삭제
		 * 4. 빌려간 사람 리스트+책
		 * 5. 책 리스트
		 * -------------------------
		 * 2.회원
		 * 로그인
		 * 회원가입
		 * ========
		 * 1.책 리스트 (별점,대여가능여부,몇권남았는지)
		 *  - 전체
		 *  - 분야별
		 *  - 이달의 책
		 * 2. 도서검색
		 * 3. 도서대여(3권까지 가능, 7일동안)
		 * 4. 도서반납
		 * (도서수량 0이면 못 빌림, 대여하면 -1, 반납하면 +1)
		 * 5. 대여불가능한 도서 예약하기
		 * 
		 * */
		
	}

}
